storage/tests/46b979bf-0a93-4a86-a2b6-31efdd25ffa3/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/46b979bf-0a93-4a86-a2b6-31efdd25ffa3/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00.9s/30s

running (0m01.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  01.9s/30s

running (0m02.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m03.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  03.9s/30s

running (0m04.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  04.9s/30s

running (0m05.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  05.9s/30s

running (0m06.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m07.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  07.9s/30s

running (0m08.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  08.9s/30s

running (0m09.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  09.9s/30s

running (0m10.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  10.9s/30s

running (0m11.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  11.9s/30s

running (0m12.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m13.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  13.9s/30s

running (0m14.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m15.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  15.9s/30s

running (0m16.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36818->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36774->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36862->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36934->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37016->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37002->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36992->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37054->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36840->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37066->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37096->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37106->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37084->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37058->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36806->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37068->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36892->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36894->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36888->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36916->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36918->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36832->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36930->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36772->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36768->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36848->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36906->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36874->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36964->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36936->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36962->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36876->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37026->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:36776->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37038->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:35:46+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:37086->127.0.0.1:4000: read: connection reset by peer"

running (0m17.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  17.9s/30s

running (0m18.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  18.9s/30s

running (0m19.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  19.9s/30s

running (0m20.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m22.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  22.9s/30s

running (0m23.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  23.9s/30s

running (0m24.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  24.9s/30s

running (0m25.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  25.9s/30s

running (0m26.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  26.9s/30s

running (0m27.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m28.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  28.9s/30s

running (0m29.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  29.9s/30s

running (0m30.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m31.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m32.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m33.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44460->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44368->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44500->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44414->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44156->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44150->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44110->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:43952->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41962->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44218->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:42568->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44026->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44316->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:43968->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41862->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44280->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41802->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44290->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44238->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44438->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:43818->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:42400->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41688->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:42424->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:43920->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:42022->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41898->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44328->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44098->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44352->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44242->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44154->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44084->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44012->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44418->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44058->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44338->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:41746->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:42458->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44492->127.0.0.1:4000: read: connection reset by peer"
time="2026-04-23T17:36:02+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:4000/todos\": read tcp 127.0.0.1:44252->127.0.0.1:4000: read: connection reset by peer"

running (0m34.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m35.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m36.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m37.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m38.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m39.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m40.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m41.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m42.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m43.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m44.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m45.9s), 0952/1000 VUs, 48 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m46.9s), 0839/1000 VUs, 161 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m47.9s), 0839/1000 VUs, 161 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m48.9s), 0837/1000 VUs, 163 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m49.9s), 0808/1000 VUs, 192 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m50.9s), 0808/1000 VUs, 192 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m51.9s), 0585/1000 VUs, 415 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m52.9s), 0582/1000 VUs, 418 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m53.9s), 0582/1000 VUs, 418 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m54.9s), 0581/1000 VUs, 419 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m55.9s), 0581/1000 VUs, 419 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m56.9s), 0435/1000 VUs, 565 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m57.9s), 0434/1000 VUs, 566 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m58.9s), 0434/1000 VUs, 566 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m59.9s), 0434/1000 VUs, 566 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 11337  188.931706/s
    checks_succeeded...: 64.34% 7295 out of 11337
    checks_failed......: 35.65% 4042 out of 11337

    ✗ status is 2xx/3xx
      ↳  64% — ✓ 7295 / ✗ 4042

    HTTP
    http_req_duration..............: avg=3.59s  min=100.93µs med=216.84ms max=29.39s p(90)=13.61s p(95)=16.61s
      { expected_response:true }...: avg=2.47s  min=100.93µs med=330.44ms max=16.33s p(90)=6.43s  p(95)=10.51s
    http_req_failed................: 35.65% 4042 out of 11337
    http_reqs......................: 11337  188.931706/s

    EXECUTION
    iteration_duration.............: avg=51.09s min=45.43s   med=51.26s   max=57.67s p(90)=56.64s p(95)=56.64s
    iterations.....................: 566    9.43242/s
    vus............................: 434    min=434           max=1000
    vus_max........................: 1000   min=1000          max=1000

    NETWORK
    data_received..................: 69 MB  1.1 MB/s
    data_sent......................: 1.5 MB 24 kB/s



running (1m00.0s), 0000/1000 VUs, 566 complete and 434 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s